[
  "User: I have needle like sensations in my feet",
  "Bot: Do you have a diagnosis of diabetes or consistently high blood sugar levels?",
  "User: I actually do",
  "Bot: Do you take any medications known to cause neuropathy, such as chemotherapy agents or high‑dose statins?",
  "User: No, actually, it usually happens when I sit on the commode for too long or sleep in a wrong position, in which case maybe blood flow stops and I get really sharp needle sensations in my feet!",
  "Bot: Do you notice any pallor or bluish discoloration of your feet when the needle‑like sensations occur?",
  "User: No, actually, it usually happens when I sit on the commode for too long or sleep in a wrong position, in which case maybe blood flow stops and I get really sharp needle sensations in my feet!",
  "Bot: Is the tingling sensation primarily located on the inner side of the ankle and foot?",
  "User: No, actually, it usually happens when I sit on the commode for too long or sleep in a wrong position, in which case maybe blood flow stops and I get really sharp needle sensations in my feet!",
  "Bot: Do you experience foot pain or cramping while walking that improves with rest?",
  "User: No, actually, it usually happens when I sit on the commode for too long or sleep in a wrong position, in which case maybe blood flow stops and I get really sharp needle sensations in my feet!",
  "Bot: Do you have persistent loss of sensation to light touch or pinprick in your feet when you are not sitting or lying in a particular position?",
  "User: No, actually, it usually happens when I sit on the commode for too long or sleep in a wrong position, in which case maybe blood flow stops and I get really sharp needle sensations in my feet!",
  "Bot: Do you have any weakness in your feet, such as difficulty lifting your toes?",
  "User: I have headache ",
  "Bot: Do you have a fever?",
  "User: yes maybe",
  "Bot: Do you have neck stiffness or increased sensitivity to light?",
  "User: yeah",
  "Bot: Did the headache start suddenly and feel like the worst headache of your life?",
  "User: I am experiencing headache and fever with extreme sensitivity from light",
  "Bot: Do you have neck stiffness?",
  "User: yes",
  "Bot: Do you describe the headache as a sudden “thunderclap” that reached its worst intensity within minutes?",
  "User: yes",
  "Bot: **Urgent evaluation needed** – go to the nearest emergency department immediately.\n\n**Tests to distinguish the possibilities**\n1. **Non‑contrast head CT** (within minutes) – detects acute subarachnoid hemorrhage or large brain abscess.\n2. **CT angiography (CTA) or MR angiography** – if CT is negative, evaluates for aneurysm or vascular malformation causing SAH.\n3. **Lumbar puncture** (after CT rules out mass effect) – CSF analysis for cell count, glucose, protein, Gram stain, culture, PCR for viral pathogens.\n4. **CBC with differential & blood cultures** – supports bacterial infection.\n5. **MRI brain with contrast** (if CT/LP inconclusive) – better for early brain abscess or encephalitis.\n\n**Interim recommendations & red‑flags**\n- **Call emergency services (911)** now; do not drive yourself.\n- Keep the head elevated 30°, avoid straining or Valsalva maneuvers.\n- Monitor for worsening mental status, new seizures, vomiting, or loss of consciousness – if any occur, seek immediate help.\n- Do not take any NSAIDs or anticoagulants before evaluation unless prescribed.\n- Bring a list of current medications, allergies, and recent infections (e.g., sinus, respiratory).\n\n**What to expect in the ED**\n- Rapid neuro‑imaging, possible neurosurgical consult if SAH is found.\n- Empiric intravenous antibiotics and dexamethasone if bacterial meningitis is suspected, pending cultures.\n- Antiviral therapy (e.g., acyclovir) if viral encephalitis/meningitis is a concern.\n\nPrompt evaluation is critical because subarachnoid hemorrhage and bacterial meningitis are life‑threatening emergencies.",
  "User: I am experiencing headache ",
  "Bot: Do you have nausea or increased sensitivity to light or sound?",
  "User: yes",
  "Bot: **Urgent action:** Call emergency services (911) or go to the nearest emergency department immediately. This presentation is a medical emergency.\n\n**Immediate evaluations in the ED**\n1. **Non‑contrast head CT** – first‑line to detect acute subarachnoid hemorrhage or large mass/abscess.\n2. **If CT is negative and SAH is still suspected:** CT angiography (CTA) or MR angiography to look for aneurysm or vascular malformation.\n3. **Lumbar puncture** (after CT rules out mass effect) – CSF analysis for cell count, glucose, protein, Gram stain, culture, PCR for viral pathogens (e.g., HSV, enterovirus) and for xanthochromia (SAH).\n4. **CBC with differential, blood cultures, CRP/ESR** – assess for bacterial infection and inflammation.\n5. **MRI brain with contrast** (if CT/LP inconclusive) – better for early brain tumor, abscess, or encephalitis.\n6. **COVID‑19 PCR or rapid antigen test** – if respiratory symptoms or exposure history.\n\n**Specialists to involve**\n- **Neurology** (assessment of SAH, meningitis, tumor)\n- **Neurosurgery** (if SAH or mass lesion identified)\n- **Infectious disease** (if meningitis/encephalitis confirmed)\n- **Emergency medicine** (initial stabilization)\n\n**Interim care while awaiting transport**\n- Keep head elevated ~30°, avoid straining or Valsalva maneuvers.\n- Do **not** take NSAIDs, aspirin, anticoagulants, or any new medications unless prescribed.\n- Monitor for worsening mental status, new seizures, vomiting, focal weakness, or loss of consciousness – if any occur, call 911 again.\n- Bring a list of current medications, allergies, recent infections or vaccinations.\n\n**Red‑flag signs that require immediate re‑evaluation**\n- Sudden loss of consciousness or seizures\n- New focal neurological deficits (weakness, speech changes, vision loss)\n- Persistent vomiting or severe nausea unrelieved by anti‑emetics\n- Rapidly worsening headache or change in character\n- High fever (>39 °C) or rapid deterioration in mental status\n\nPrompt evaluation is critical because both subarachnoid hemorrhage and bacterial meningitis can be rapidly fatal if untreated.",
  "User: I have headache ",
  "Bot: Is the headache accompanied by nausea, vomiting, or sensitivity to light?",
  "User: yes",
  "Bot: Is the pain throbbing and located on one side of your head?",
  "User: yeah",
  "Bot: **Urgent action:** Call emergency services (911) or go to the nearest emergency department immediately. This presentation can be life‑threatening.\n\n**Diagnostic work‑up that will distinguish the possibilities**\n1. **Non‑contrast head CT (within minutes)** – detects acute subarachnoid hemorrhage, large intracranial hemorrhage, or mass effect from a tumor.\n2. **CT angiography (CTA) or MR angiography** – if the CT is negative but suspicion for vascular bleed remains, evaluates for aneurysm or arteriovenous malformation.\n3. **Lumbar puncture** (after CT rules out mass effect) – CSF analysis for xanthochromia (SAH), cell count, glucose, protein, Gram stain, culture, and PCR for viral pathogens (meningitis/encephalitis).\n4. **MRI brain with and without contrast** – superior for early brain tumor, small abscess, or encephalitis not seen on CT.\n5. **CBC with differential, blood cultures, CRP/ESR** – assess for infection and inflammation.\n6. **Medication review** – document frequency and type of analgesics taken; >10 days/month of triptans, ergotamines, NSAIDs, or opioids suggests medication‑overuse headache.\n\n**Specialists to involve**\n- Emergency Medicine (initial stabilization)\n- Neurology (assessment of SAH, meningitis, tumor)\n- Neurosurgery (if SAH or surgically‑resectable tumor identified)\n- Infectious Disease (if meningitis/encephalitis confirmed)\n\n**Interim recommendations while awaiting transport**\n- Keep head elevated ~30°, avoid straining, Valsalva, or heavy lifting.\n- Do **not** take NSAIDs, aspirin, anticoagulants, or any new medication unless prescribed.\n- Monitor for worsening mental status, new focal weakness, seizures, repeated vomiting, or loss of consciousness – if any occur, call 911 again.\n- Bring a list of all current medications, allergies, recent infections, and any recent head trauma.\n\n**Red‑flag signs that require immediate re‑evaluation (if they develop en route)**\n- Sudden loss of consciousness or seizure activity\n- New focal neurological deficits (weakness, speech changes, vision loss)\n- Persistent vomiting that cannot be controlled\n- Rapidly escalating headache intensity or change in character\n- High fever (>39 °C) with rapid mental status decline\n\nPrompt evaluation is critical because subarachnoid hemorrhage and bacterial meningitis can be rapidly fatal, and early treatment improves outcomes for all listed conditions.",
  "User: Tips for better sleep",
  "Bot: Do you have difficulty falling asleep, staying asleep, or waking up too early?",
  "User: best way for weight loss",
  "Bot: **Diagnosis:** Obesity (excess body weight).\n\n**Evidence‑based weight‑loss plan**\n\n1. **Nutrition**\n   - Aim for a daily calorie deficit of 500–750 kcal (≈0.5–1 kg loss per week).\n   - Follow a balanced, reduced‑calorie diet rich in vegetables, fruits, lean protein, whole grains, and healthy fats.\n   - Limit sugary drinks, refined carbs, processed foods, and excess saturated fat.\n   - Consider a structured plan (e.g., Mediterranean diet, DASH, or a medically supervised very‑low‑calorie diet if BMI ≥ 35 kg/m²).\n\n2. **Physical Activity**\n   - At least 150 min/week of moderate‑intensity aerobic activity (brisk walking, cycling) or 75 min/week of vigorous activity (running, swimming).\n   - Add muscle‑strengthening activities on ≥2 days/week.\n   - Start slowly and increase duration/intensity as tolerated.\n\n3. **Behavioral Strategies**\n   - Keep a food and activity log (paper or app) to increase awareness.\n   - Set SMART goals (Specific, Measurable, Achievable, Relevant, Time‑bound).\n   - Use portion control tools (hand‑size portions, measuring cups).\n   - Seek support from friends, family, or a weight‑loss group.\n\n4. **Professional Support**\n   - **Registered Dietitian/Nutritionist:** for personalized meal planning and monitoring.\n   - **Primary Care Provider:** to assess comorbidities (e.g., hypertension, diabetes) and consider pharmacologic therapy (e.g., GLP‑1 agonists) if lifestyle changes alone are insufficient and BMI ≥ 30 kg/m² (or ≥ 27 kg/m² with obesity‑related disease).\n   - **Behavioral Therapist or Health Coach:** for motivation, coping strategies, and relapse prevention.\n\n5. **Monitoring**\n   - Weigh yourself weekly (same time, same conditions) to track progress.\n   - Re‑evaluate diet and activity plan every 4–6 weeks; adjust as needed.\n\n**Red‑flag symptoms (seek immediate medical attention)**\n- Unexplained rapid weight loss (>5 % body weight in <4 weeks) or gain.\n- New chest pain, shortness of breath at rest, or palpitations.\n- Persistent abdominal pain, vomiting, or change in bowel habits.\n- Severe fatigue, dizziness, or fainting.\n- Signs of eating disorder (extreme restriction, binge/purge cycles).\n\n**When to seek urgent care**\nIf you develop any of the above red‑flag symptoms, call emergency services or go to the nearest emergency department.\n\n**Follow‑up**\nSchedule a visit with your primary care provider in 3 months to review weight change, labs (lipid panel, fasting glucose/HbA1c), and discuss whether additional interventions are needed.\n\n**Bottom line**\nA sustainable 5–10 % weight loss over 6–12 months markedly improves health outcomes. Combine calorie‑controlled nutrition, regular exercise, and behavioral support, and involve healthcare professionals for personalized guidance and safety.",
  "User: I don't have a girlfriend ",
  "Bot: Are you experiencing any physical or mental health symptoms you'd like help with?",
  "User: har jagah wo dikhri hai ",
  "Bot: Is the “thing” you’re noticing a visual sensation (e.g., spots, flashes, colors) rather than a change on your skin?",
  "User: im blushing",
  "Bot: Is the facial redness accompanied by itching or a raised rash?",
  "User: mujhe jodo me dard ho rha hai",
  "Bot: Do you experience morning stiffness in the affected joints that lasts longer than 30 minutes?",
  "User: yes",
  "Bot: Are multiple small joints of your hands or feet symmetrically swollen and tender?",
  "User: no",
  "Bot: Did the joint pain begin after a specific injury or trauma?"
]